function dYdt = f_air(Y, t)

  global c_f;
  global gamma;
  global d;

  % Ускорение свободного падения
  g = 9.81;

  % Плотность воздуха
  rho = 1.29;

  % Коэффициент сопротивления снаряда
  k = 3 * c_f * rho / 4 / gamma / d;

  % Модуль скорости снаряда
  v = sqrt(Y(3) * Y(3) + Y(4) * Y(4));

  % Система уравнений движения
  dYdt(1) = Y(3);
  dYdt(2) = Y(4);
  dYdt(3) = - k * v * Y(3);
  dYdt(4) = - k * v* Y(4) - g;

endfunction

%-------------------------------------------------------------------------------
% Параметры стрельбы
%-------------------------------------------------------------------------------

% начальная скорость снаряда
v0 = 119;
% угол наклона ствола пушки к горизонту
alpha = 45 * pi / 180;

%-------------------------------------------------------------------------------
% Начальные условия
%-------------------------------------------------------------------------------
x0 = 0;
y0 = 0;
vx0 = v0 * cos(alpha);
vy0 = v0 * sin(alpha);

Y0 = [x0; y0; vx0; vy0];

%-------------------------------------------------------------------------------
% Параметры временного интервала
%-------------------------------------------------------------------------------

% начальный момент времени
t0 = 0;
% конечный момент времени
tend = 15;
% шаг выдачи решения
deltaT = 0.1;

% Массив интересующих нас моментов времени
t = [t0:deltaT:tend];

% Интрегрируем систему уравнений движения
Y_air = lsode("f_air", Y0, t);

% Рисуем траекторию полета снаряда
plot(Y_air(:,1), Y_air(:,2));
%-------------------------------------------------------------------------------
% Параметры снаряда
%-------------------------------------------------------------------------------

% плотность материала снаряда
global gamma = 7800;
% коэффициент сопростивления формы (для шара)
global c_f = 0.64;
% калибр
global d = 0.12;
